{"id":15,"date":"2023-11-16T11:24:45","date_gmt":"2023-11-16T11:24:45","guid":{"rendered":"https:\/\/congres.livetvstream.online\/?p=15"},"modified":"2023-11-16T11:24:47","modified_gmt":"2023-11-16T11:24:47","slug":"there-is-no-alternative-to-new-research-and-innovation-for-the-development-of-the-country","status":"publish","type":"post","link":"https:\/\/congres.livetvstream.online\/2023\/11\/16\/there-is-no-alternative-to-new-research-and-innovation-for-the-development-of-the-country\/","title":{"rendered":"&#8216;There is no alternative to new research and innovation for the development of the country&#8217;"},"content":{"rendered":"\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/www.banglanews24.com\/public\/uploads\/2023\/11\/16\/1700133767.Phot%20-%202023-11-16T172240.885.jpg\" alt=\"'There is no alternative to new research and innovation for the development of the country'\"\/><\/figure>\n\n\n\n<p><strong>Jamalpur<\/strong>&nbsp;: Bangladesh University Grants Commission (UGC) member Professor Dr. thinks that there is no alternative to new research and innovation for the development of the country.&nbsp;Md.&nbsp;Sajjad Hossain.<\/p>\n\n\n\n<p>He said, &#8216;Universities should play a leading role in creating science-minded and humanitarian people in today&#8217;s technology-dependent world.The history of the university is very old.&nbsp;Its role in the development of mankind is also extensive.&nbsp;In this continuation, we also have to participate in the development of the country and the nation from our respective places.&nbsp;For the development of the country by using science and technology, new research and strategies have to be invented.&nbsp;&#8216;<\/p>\n\n\n\n<p>He said these things while addressing the chief guest at the three-day national conference organized by the Department of Computer Science and Engineering (CSE) of Bangamata Sheikh Fazilatunnessa Mujib University of Science and Technology (Bashefmubiprobi) on Wednesday (November 15) morning.<\/p>\n\n\n\n<p>In the speech of the chief guest by joining the program virtually, the country&#8217;s renowned information technology professor Dr.&nbsp;Md.&nbsp;Sajjad Hossain also said, &#8216;In order to create skilled manpower for building a smart Bangladesh, the curriculum of the university should be modernized by including various modern technologies including robotics and Internet of Things (IoT), Artificial Intelligence (AI), digital security, big data, blockchain.&nbsp;Research activities should be increased using technology, innovation should be increased.&nbsp;&#8216;&nbsp;<\/p>\n\n\n\n<p>Pointing out that the government is working to improve the quality of life of the people and establish a knowledge-based economy through digitization, innovation and research-based education, he said, &#8216;If these modern technologies are added to the university curriculum, skilled manpower will be created in the country and a large amount of foreign exchange will be earned by exporting these manpower abroad. will be possible.&nbsp;&#8216;<\/p>\n\n\n\n<p>He emphasized on increasing the knowledge and skills of the students with the aim of creating an efficient and self-reliant manpower to keep pace with the world. &nbsp;<\/p>\n\n\n\n<p>University Vice-Chancellor Professor Dr.&nbsp;Md.&nbsp;Kamrul Alam Khan presided. &nbsp;<\/p>\n\n\n\n<p>He said, &#8216;Hopefully, this conference will increase the power of knowledge and understanding of students.&nbsp;Such seminars and conferences will continue to be organized in the future for the welfare of the students.&nbsp;With the aim of building smart &nbsp;&nbsp;<br>Bangladesh, some teams from Jagannath University, Sheikh Hasina University, Sheikh Fazilatunnecha Mujib University participated in the conference titled &#8216;National Conference on Robotics and IOT&#8217;.&nbsp;Teams showcased various projects including their own built robots.&nbsp;Various posters are also displayed.<\/p>\n\n\n\n<p>Workshops were held on the first two days of the conference, which started on November 13 and 14.&nbsp;In the first part of the seminar held on Wednesday, the main article was first presented by Associate Professor of Robotics and Mechatronics Engineering Department of Dhaka University.&nbsp;Shamim Ahmed Dewan.&nbsp;In the next phase, the director of IMCT department of UGC.&nbsp;Md.&nbsp;Sultan Mahmud Bhuiyan presented the original article.<\/p>\n\n\n\n<p>University Treasurer Mohammad Abdul Mannan and Registrar Syed Farooq Hossain were present as special guests in the conference.&nbsp;And the general manager of BRAC Net Limited.&nbsp;Sabbir Hossain, Solution Manager (Pre-Sale and Partner Management) of the company spoke on behalf of Mokarram Hossain.&nbsp;The coordinator of the conference was the chairman of Computer Science and Engineering (CSE) department.&nbsp;Humayan Kabir.<\/p>\n\n\n\n<p>The title sponsor of the conference was BRAC Net Limited, the country&#8217;s most dynamic internet service provider.&nbsp;And the support partner was Bangladesh&#8217;s renowned IT distributor company Global Brand Private Limited and Software Shell.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Jamalpur&nbsp;: Bangladesh University Grants Commission (UGC) member Professor Dr. thinks that there is no alternative to new research and innovation for the development of the country.&nbsp;Md.&nbsp;Sajjad Hossain. He said, &#8216;Universities should play a leading role in creating science-minded and humanitarian people in today&#8217;s technology-dependent world.The history of the university is very old.&nbsp;Its role in the &#8230; <a title=\"&#8216;There is no alternative to new research and innovation for the development of the country&#8217;\" class=\"read-more\" href=\"https:\/\/congres.livetvstream.online\/2023\/11\/16\/there-is-no-alternative-to-new-research-and-innovation-for-the-development-of-the-country\/\" aria-label=\"More on &#8216;There is no alternative to new research and innovation for the development of the country&#8217;\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/congres.livetvstream.online\/wp-json\/wp\/v2\/posts\/15"}],"collection":[{"href":"https:\/\/congres.livetvstream.online\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/congres.livetvstream.online\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/congres.livetvstream.online\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/congres.livetvstream.online\/wp-json\/wp\/v2\/comments?post=15"}],"version-history":[{"count":1,"href":"https:\/\/congres.livetvstream.online\/wp-json\/wp\/v2\/posts\/15\/revisions"}],"predecessor-version":[{"id":16,"href":"https:\/\/congres.livetvstream.online\/wp-json\/wp\/v2\/posts\/15\/revisions\/16"}],"wp:attachment":[{"href":"https:\/\/congres.livetvstream.online\/wp-json\/wp\/v2\/media?parent=15"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/congres.livetvstream.online\/wp-json\/wp\/v2\/categories?post=15"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/congres.livetvstream.online\/wp-json\/wp\/v2\/tags?post=15"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}